In [5]:
#importing pymsql
#pip install PyMySQL
#pip install sqlalchemy
import pymysql
import pandas as pd
import sqlalchemy

In [6]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:@localhost:3306/test")
#if your phpmyadmin has password put before the @ symbol

In [16]:
data=pd.read_sql_table('stud1',engine)
#read_sql_query() can also be used where we can write query. the query should be properly quoted as document string ''''''
#eg:query="""select * from emp where city='Bangalore'"""
#pd.read_sql_query(query,engine)

In [17]:
data.head()

   SRN     Name  Marks  CGPA
0  101  Shravya    100   8.0

## Writing to a Database from Python

In [19]:
df=pd.read_csv("csv_data_stud.csv")
df.to_sql(name='stud',
          con=engine,
          index=False,
          if_exists='append')
df

   srn      Name  CGPA
0  107       Ram   9.0
1  108      Sita   7.8
2  109  Lakshman   9.3

## Other Databases

##### from sqlalchemy import create_engine

##### engine = create_engine('postgresql://scott:tiger@localhost:5432/mydatabase')

##### engine = create_engine('mysql+mysqldb://scott:tiger@localhost/foo')

engine = create_engine('oracle://scott:tiger@127.0.0.1:1521/sidname')

engine = create_engine('mssql+pyodbc://mydsn')

#sqlite:///

#where is relative: engine = create_engine('sqlite:///foo.db')

#or absolute, starting with a slash: engine = create_engine('sqlite:////absolute/path/to/foo.db')